{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/share/huggingface/Qwen-1_8B-Chat",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "deltaT": 1,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "mlp.w1",
    "mlp.c_proj",
    "attn.c_attn",
    "mlp.w2",
    "attn.c_proj"
  ],
  "target_r": 8,
  "task_type": "CAUSAL_LM",
  "tfinal": 0,
  "tinit": 0,
  "total_step": null,
  "use_dora": false,
  "use_rslora": false
}